<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bb4d46fabe5ea312f3f37e5108f46dbec6b9c8e2fac373432748840f73ef6e60","plan_job_ref":"Job PR on main #33 at https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/9069808477","plan_out_hash":"2854daea05654b86aa9b8fbe680736636eff58182943ac672b3a91722cecd5a0","plan_hash":"a8235841d4ee3b1db84dae907118a9ff907a8be5421584e95f3c1b49222d010e","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __apps/platform/terraform/__
With backend config files: `apps/platform/terraform/backends/prod.s3.tfbackend`
With var files: `apps/platform/terraform/vars/prod.tfvars`
<details>
<summary>Plan: 1 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs-web-app.module.alb_ingress.data.aws_lb_target_group.default[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lb_target_group" "default" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = (known after apply)
+       health_check                       = (known after apply)
+       id                                 = (known after apply)
+       lambda_multi_value_headers_enabled = (known after apply)
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = (known after apply)
+       port                               = (known after apply)
+       preserve_client_ip                 = (known after apply)
+       protocol                           = (known after apply)
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = (known after apply)
+       slow_start                         = (known after apply)
+       stickiness                         = (known after apply)
+       tags                               = (known after apply)
+       target_type                        = (known after apply)
+       vpc_id                             = (known after apply)
    }

  # module.ecs-web-app.module.alb_ingress.aws_lb_listener_rule.unauthenticated_paths[0] will be updated in-place
!~  resource "aws_lb_listener_rule" "unauthenticated_paths" {
        id           = "arn:aws:elasticloadbalancing:eu-central-1:381491873946:listener-rule/app/softkitit-prod/ef6d96e445dc3af8/4d1d425d9f90653b/82c844e0f208b015"
        tags         = {}
#        (4 unchanged attributes hidden)

!~      action {
!~          target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:381491873946:targetgroup/softkit-nestjs-boilerplate-689a8/583193c142013dc3" -> (known after apply)
#            (2 unchanged attributes hidden)
        }

-       condition {
-           path_pattern {
-               values = [
-                   "/api/platform/*",
                ] -> null
            }
        }
+       condition {
+           path_pattern {
+               values = [
+                   "/api/platform",
                ]
            }
        }
    }

  # module.ecs-web-app.module.alb_ingress.aws_lb_target_group.default[0] must be replaced
+/- resource "aws_lb_target_group" "default" {
!~      arn                                = "arn:aws:elasticloadbalancing:eu-central-1:381491873946:targetgroup/softkit-nestjs-boilerplate-689a8/583193c142013dc3" -> (known after apply)
!~      arn_suffix                         = "targetgroup/softkit-nestjs-boilerplate-689a8/583193c142013dc3" -> (known after apply)
!~      id                                 = "********************************************************************************************************************" -> (known after apply)
!~      ip_address_type                    = "ipv4" -> (known after apply)
!~      load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
        name                               = "softkit-nestjs-boilerplate-689a8"
+       preserve_client_ip                 = (known after apply)
!~      protocol_version                   = "HTTP2" -> "HTTP1" # forces replacement
        tags                               = {
            "Environment" = "prod"
            "Name"        = "softkit-nestjs-boilerplate-prod-platform"
            "Namespace"   = "softkit-nestjs-boilerplate"
            "Project"     = "platform"
            "Repository"  = "softkit-nestjs-boilerplate"
        }
#        (11 unchanged attributes hidden)

!~      health_check {
!~          interval            = 5 -> 15
!~          matcher             = "200-499" -> "200-399"
!~          timeout             = 2 -> 10
#            (6 unchanged attributes hidden)
        }

-       target_failover {}

#        (1 unchanged block hidden)
    }

  # module.ecs-web-app.module.ecs_alb_service_task.aws_ecs_service.ignore_changes_task_definition[0] will be updated in-place
!~  resource "aws_ecs_service" "ignore_changes_task_definition" {
        id                                 = "arn:aws:ecs:eu-central-1:381491873946:service/softkitit-prod/softkit-nestjs-boilerplate-prod-platform"
        name                               = "softkit-nestjs-boilerplate-prod-platform"
        tags                               = {
            "Environment" = "prod"
            "Name"        = "softkit-nestjs-boilerplate-prod-platform"
            "Namespace"   = "softkit-nestjs-boilerplate"
            "Project"     = "platform"
            "Repository"  = "softkit-nestjs-boilerplate"
        }
#        (17 unchanged attributes hidden)

-       load_balancer {
-           container_name   = "softkit-nestjs-boilerplate-prod-platform" -> null
-           container_port   = 80 -> null
-           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:381491873946:targetgroup/softkit-nestjs-boilerplate-689a8/583193c142013dc3" -> null
#            (1 unchanged attribute hidden)
        }
+       load_balancer {
+           container_name   = "softkit-nestjs-boilerplate-prod-platform"
+           container_port   = 80
+           target_group_arn = (known after apply)
#            (1 unchanged attribute hidden)
        }

#        (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.ecs-web-app.module.ecs_codepipeline.module.codebuild.aws_s3_bucket.cache_bucket,
  on /tmp/terraform-data-dir/modules/ecs-web-app.ecs_codepipeline.codebuild/main.tf line 11, in resource "aws_s3_bucket" "cache_bucket":
  11:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [PR on main #33](https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/9069808477)